In [1]:
import pandas as pd

In [11]:
departments = pd.read_csv('../data/departments.csv', header=None)
departments

     0                         1
0    1        Product Management
1    2                     Sales
2    3  Research and Development
3    4      Business Development
4    5               Engineering
5    6           Human Resources
6    7                  Services
7    8                   Support
8    9                 Marketing
9   10                  Training
10  11                     Legal
11  12                Accounting

In [5]:
departments.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 2 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   1                   11 non-null     int64
 1   Product Management  11 non-null     object
dtypes: int64(1), object(1)
memory usage: 308.0+ bytes

In [8]:
employees = pd.read_csv('../data/hired_employees.csv', header=None)
employees

         0                   1                     2     3      4
0        1         Harold Vogt  2021-11-07T02:48:42Z   2.0   96.0
1        2            Ty Hofer  2021-05-30T05:43:46Z   8.0    NaN
2        3         Lyman Hadye  2021-09-01T23:27:38Z   5.0   52.0
3        4       Lotti Crowthe  2021-10-01T13:04:21Z  12.0   71.0
4        5      Gretna Lording  2021-10-10T22:22:17Z   6.0   80.0
...    ...                 ...                   ...   ...    ...
1994  1995          Goran Yong  2021-08-22T21:57:53Z   2.0   83.0
1995  1996  Cirstoforo Youings  2021-04-01T17:48:42Z   3.0   23.0
1996  1997     Wilek Yurkevich  2021-05-04T12:19:50Z   2.0  132.0
1997  1998          Jerry Yven  2021-10-03T14:12:50Z   7.0  100.0
1998  1999       Jerri Zebedee  2022-01-18T10:47:37Z   8.0   80.0

[1999 rows x 5 columns]

In [46]:
employees[2] = pd.to_datetime(employees[2], format='%Y-%m-%dT%H:%M:%SZ')

In [48]:
employees[2][0]

Timestamp('2021-11-07 02:48:42')

In [24]:
employees[4].unique()

array([ 96.,  nan,  52.,  71.,  80.,  95.,  78., 169.,   8.,  62.,  41.,
        29.,  83., 121.,  47.,  65., 102.,  68.,  85.,  25.,  36.,  93.,
        53.,  74., 134.,  67.,  33.,  82.,  49.,  31., 178.,  57., 114.,
        54., 113.,  75.,  37.,  26.,  51., 118., 138.,  59.,  64.,  58.,
       140.,  35.,  76., 115.,  34.,  40.,  38.,  91., 128., 104.,  61.,
        15., 123.,  72.,   3.,  87.,  60., 161., 163.,  73.,  90.,  84.,
       124.,  48.,  81., 150.,  99.,  66., 107.,  24.,  17., 103.,  63.,
        39.,  89.,  56.,  79., 126., 149., 132., 147., 145., 117.,  44.,
        43.,  69., 111.,  50.,  21.,  88.,  46., 130.,  86., 159.,  13.,
        97., 137.,  42., 116.,  77., 136.,  16.,  92., 127.,  27., 143.,
       142., 120., 125., 109.,  55.,  30.,  19.,  45., 152.,  70., 101.,
        20., 112., 158., 157.,  18., 100., 141.,  14., 105., 106.,  28.,
        22., 148.,  98., 153.,  23., 164.,  11., 108., 174., 162., 144.,
        94., 165., 129., 119.,  32., 154., 135., 173., 133., 156.,  10.,
       171., 166., 110.,   9., 122.,   7., 175., 168.,   5., 155., 146.,
       160.,   1., 182., 139., 151., 131.,  12., 172.])

In [7]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1998 entries, 0 to 1997
Data columns (total 5 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   1                     1998 non-null   int64
 1   Harold Vogt           1979 non-null   object
 2   2021-11-07T02:48:42Z  1984 non-null   object
 3   2                     1977 non-null   float64
 4   96                    1982 non-null   float64
dtypes: float64(2), int64(1), object(2)
memory usage: 78.2+ KB

In [14]:
employees[2][0]

'2021-11-07T02:48:42Z'

In [9]:
jobs = pd.read_csv('../data/jobs.csv', header=None)
jobs

       0                            1
0      1          Marketing Assistant
1      2                     VP Sales
2      3           Biostatistician IV
3      4    Account Representative II
4      5                 VP Marketing
..   ...                          ...
178  179         Software Engineer II
179  180              Statistician IV
180  181         Programmer Analyst I
181  182     Account Representative I
182  183  Administrative Assistant IV

[183 rows x 2 columns]

In [10]:
jobs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 183 entries, 0 to 182
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       183 non-null    int64
 1   1       183 non-null    object
dtypes: int64(1), object(1)
memory usage: 3.0+ KB